# CREAR TABLAS EN SQL

In [ ]:
# Importamos las librerías necesarias para poder hacer queries en Python
import sqlite3
# importamos la librería pandas para visualizar la salida
import pandas as pd

In [2]:
# Nos conectamos a una db de sqlite3
conn = sqlite3.connect('airbnb.db')
print("Opened database successfully");

 #Aquí podemos escribir la
conn.execute('''-----''')

conn.commit()

print("Table created successfully");

Opened database successfully
Table created successfully

CREATE TABLE

In [4]:
# cada vez que queremos hacer una query se comienza con conn.execute
conn.execute('''
CREATE TABLE airbnb_listings(
	id INT AUTO_INCREMENT UNIQUE PRIMARY KEY,
	city VARCHAR(255) NOT NULL,
  country VARCHAR(255) NOT NULL,
  number_of_rooms INT NOT NULL,
	created_at INT NOT NULL
);''')

conn.commit()

INSERT DATA

In [5]:
# cada vez que queremos hacer una query se comienza con conn.execute
conn.execute('''
INSERT INTO airbnb_listings(id, city, country, number_of_rooms, created_at)
VALUES(1, 'París', 'Francia', 5, 2018),
      (2, 'Tokio', 'Japón', 2, 2017),
      (3, 'Nueva York', 'USA', 2, 2022),
      (4, 'Madrid', 'España', 3, 2022);''')
conn.commit()

DROP TABLE

In [7]:
# conn.execute('''
# DROP TABLE airbnb_listings;
# ''')
# conn.commit()

QUERY SQL

SELECT*FROM

In [9]:
# creamos la query y la guardamos en la variable qry
qry = '''
SELECT  country
FROM airbnb_listings
'''
# visualizar columna country
# para visualizar la salida, usaremos pandas
df =pd.read_sql_query(qry, conn)

df.head()

   country
0  Francia
1    Japón
2      USA
3   España

In [13]:
# creamos la query y la guardamos en la variable qry
qry = '''
SELECT city
FROM airbnb_listings;
'''

# para visualizar la salida, usaremos pandas
df =pd.read_sql_query(qry, conn)

df.head()

         city
0       París
1       Tokio
2  Nueva York
3      Madrid

In [14]:
# creamos la query y la guardamos en la variable qry
qry = '''
SELECT city, created_at
FROM airbnb_listings;
'''

# para visualizar la salida, usaremos pandas
df =pd.read_sql_query(qry, conn)

df.head()

         city  created_at
0       París        2018
1       Tokio        2017
2  Nueva York        2022
3      Madrid        2022

ORDER BY

In [10]:
# creamos la query y la guardamos en la variable qry
qry = '''
SELECT  country
FROM airbnb_listings
ORDER BY city DESC;
'''
# visualizar columna country
# para visualizar la salida, usaremos pandas
df =pd.read_sql_query(qry, conn)

df.head()

   country
0    Japón
1  Francia
2      USA
3   España

In [12]:
# creamos la query y la guardamos en la variable qry
qry = '''
SELECT  country
FROM airbnb_listings
WHERE created_at < 2020
ORDER BY city DESC;
'''
# visualizar columna country
# para visualizar la salida, usaremos pandas
df =pd.read_sql_query(qry, conn)

df.head()

   country
0    Japón
1  Francia

In [6]:
# creamos la query y la guardamos en la variable qry
qry = '''
SELECT  country
FROM airbnb_listings
WHERE created_at < 2020
ORDER BY id DESC;
'''

# para visualizar la salida, usaremos pandas
df =pd.read_sql_query(qry, conn)

df.head()

   country
0    Japón
1  Francia

Si le ponemos la final `ASC` o nada será ascendente, y si le ponemos  `DESC` será descente.

In [17]:
# orden ascendente
qry = '''
SELECT id, city
FROM airbnb_listings
ORDER BY number_of_rooms;
'''

# para visualizar la salida, usaremos pandas
df =pd.read_sql_query(qry, conn)

df.head()

   id        city
0   2       Tokio
1   3  Nueva York
2   4      Madrid
3   1       París

In [18]:
# orden descendente
qry = '''
SELECT id, city
FROM airbnb_listings
ORDER BY number_of_rooms DESC;
'''

# para visualizar la salida, usaremos pandas
df =pd.read_sql_query(qry, conn)

df.head()

   id        city
0   1       París
1   4      Madrid
2   2       Tokio
3   3  Nueva York

LIMIT

El método `LIMIT` permite limitar el número de filas que queremos obtener.

In [21]:
# solo 2 filas
qry = '''
SELECT *
FROM airbnb_listings
LIMIT 3;
'''

# para visualizar la salida, usaremos pandas
df =pd.read_sql_query(qry, conn)

df.head()

   id        city  country  number_of_rooms  created_at
0   1       París  Francia                5        2018
1   2       Tokio    Japón                2        2017
2   3  Nueva York      USA                2        2022

DISTINCT

El método `DISTINCT` nos devuelve solo los valores únicos, y descarta aquellos diplicados.

In [22]:
# obtener valores únicos de number_of_rooms
qry = '''
SELECT DISTINCT number_of_rooms
FROM airbnb_listings;
'''

# para visualizar la salida, usaremos pandas
df =pd.read_sql_query(qry, conn)

df.head()

   number_of_rooms
0                5
1                2
2                3

WHERE

Para filtrar datos que contengan ciertos valores, se suele utilizar el método `WHERE` acompañado de otras condiciones, operadores, o métodos.

In [24]:
# obtener valores con habitaciones mayor o igual a 3
qry = '''
SELECT *
FROM airbnb_listings
WHERE number_of_rooms >3;
'''

# para visualizar la salida, usaremos pandas
df =pd.read_sql_query(qry, conn)

df.head()

   id   city  country  number_of_rooms  created_at
0   1  París  Francia                5        2018

BETWEEN y AND

Si queremos usar diferentes comparaciones podremos usar el método `AND`.

Si queremos usar invervalos de valores, podemos usar el método `BETWEEN  AND`.

In [25]:
# obtener valores con habitaciones mayor o igual a 3 y menor o igual que 5
qry = '''
SELECT *
FROM airbnb_listings
WHERE number_of_rooms >=3 AND created_at <2020;
'''

# para visualizar la salida, usaremos pandas
df =pd.read_sql_query(qry, conn)

df.head()

   id   city  country  number_of_rooms  created_at
0   1  París  Francia                5        2018

In [26]:
# obtener valores con habitaciones entre 3 y 5
qry = '''
SELECT *
FROM airbnb_listings
WHERE number_of_rooms BETWEEN 3 AND 5;
'''

# para visualizar la salida, usaremos pandas
df =pd.read_sql_query(qry, conn)

df.head()

   id    city  country  number_of_rooms  created_at
0   1   París  Francia                5        2018
1   4  Madrid   España                3        2022

= IN LIKE NOT LIKE

In [27]:
# obtener valores de París
qry = '''
SELECT *
FROM airbnb_listings
WHERE city = 'Madrid';
'''

# para visualizar la salida, usaremos pandas
df =pd.read_sql_query(qry, conn)

df.head()

   id    city country  number_of_rooms  created_at
0   4  Madrid  España                3        2022

In [28]:
# obtener valores de dos países
qry = '''
SELECT *
FROM airbnb_listings
WHERE country IN ('USA','Francia');
'''

# para visualizar la salida, usaremos pandas
df =pd.read_sql_query(qry, conn)

df.head()

   id        city  country  number_of_rooms  created_at
0   1       París  Francia                5        2018
1   3  Nueva York      USA                2        2022

In [29]:
# obtener valores donde la ciudad empiece por M o no termine por K
# obtener valores de dos países
qry = '''
SELECT *
FROM airbnb_listings
WHERE city LIKE 'M%' OR city NOT LIKE '%k';
'''

# para visualizar la salida, usaremos pandas
df =pd.read_sql_query(qry, conn)

df.head()

   id    city  country  number_of_rooms  created_at
0   1   París  Francia                5        2018
1   2   Tokio    Japón                2        2017
2   4  Madrid   España                3        2022

In [30]:
# obtener valores donde la ciudad empiece por M o no termine por K
# obtener valores de dos países
qry = '''
SELECT *
FROM airbnb_listings
WHERE city LIKE 'M%' AND city NOT LIKE '%k';
'''

# para visualizar la salida, usaremos pandas
df =pd.read_sql_query(qry, conn)

df.head()

   id    city country  number_of_rooms  created_at
0   4  Madrid  España                3        2022

FILTRAR MÚLTIPLES COLUMNAS

In [ ]:
# obtener valores de París con habitaciones mayores que 3
qry = '''
SELECT *
FROM airbnb_listings
WHERE city = 'París' AND number_of_rooms >3;
'''

# para visualizar la salida, usaremos pandas
df =pd.read_sql_query(qry, conn)

df.head()

FILTRAR VALORES NULOS

In [32]:
# saber si hay valores nulos en la columna de number_of_rooms
qry = '''
SELECT *
FROM airbnb_listings
WHERE number_of_rooms IS NULL;
'''

# para visualizar la salida, usaremos pandas
df =pd.read_sql_query(qry, conn)

df.head()

Empty DataFrame
Columns: [id, city, country, number_of_rooms, created_at]
Index: []

In [33]:
#También podemos obtener los valores no nulos, con el método `NOT NULL`.
# saber si hay valores nulos en la columna de number_of_rooms
qry = '''
SELECT *
FROM airbnb_listings
WHERE number_of_rooms IS NOT NULL;
'''

# para visualizar la salida, usaremos pandas
df =pd.read_sql_query(qry, conn)

df.head()

   id        city  country  number_of_rooms  created_at
0   1       París  Francia                5        2018
1   2       Tokio    Japón                2        2017
2   3  Nueva York      USA                2        2022
3   4      Madrid   España                3        2022

AGGREGATIONS

SUMA PROMEDIO MAXIMO MINIMO

In [34]:
qry = '''
SELECT SUM(number_of_rooms)
FROM airbnb_listings;
'''
# para visualizar la salida, usaremos pandas
df =pd.read_sql_query(qry, conn)

df.head()

   SUM(number_of_rooms)
0                    12

In [35]:
qry = '''
SELECT AVG(number_of_rooms)
FROM airbnb_listings;
'''
# para visualizar la salida, usaremos pandas
df =pd.read_sql_query(qry, conn)

df.head()

   AVG(number_of_rooms)
0                   3.0

In [36]:
qry = '''
SELECT MAX(number_of_rooms)
FROM airbnb_listings;
'''
# para visualizar la salida, usaremos pandas
df =pd.read_sql_query(qry, conn)

df.head()

   MAX(number_of_rooms)
0                     5

In [37]:
qry = '''
SELECT MIN(number_of_rooms)
FROM airbnb_listings;
'''
# para visualizar la salida, usaremos pandas
df =pd.read_sql_query(qry, conn)

df.head()

   MIN(number_of_rooms)
0                     2

GROUP BY / HAVING

In [39]:
qry = '''
SELECT country, SUM(number_of_rooms) as numrum
FROM airbnb_listings
GROUP BY country
HAVING created_at < 2020;
'''
# para visualizar la salida, usaremos pandas
df =pd.read_sql_query(qry, conn)

df.head()

   country  numrum
0  Francia       5
1    Japón       2

In [41]:
qry = '''
SELECT country, AVG(number_of_rooms) as avgroom
FROM airbnb_listings
GROUP BY country;
'''
# para visualizar la salida, usaremos pandas
df =pd.read_sql_query(qry, conn)

df.head()

   country  avgroom
0   España      3.0
1  Francia      5.0
2    Japón      2.0
3      USA      2.0

In [42]:
qry = '''
SELECT country, MAX(number_of_rooms) as MAXROOM
FROM airbnb_listings
GROUP BY country;
'''
# para visualizar la salida, usaremos pandas
df =pd.read_sql_query(qry, conn)

df.head()

   country  MAXROOM
0   España        3
1  Francia        5
2    Japón        2
3      USA        2

In [43]:
qry = '''
SELECT country, MIN(number_of_rooms) as MINROOM
FROM airbnb_listings
GROUP BY country;
'''
# para visualizar la salida, usaremos pandas
df =pd.read_sql_query(qry, conn)

df.head()

   country  MINROOM
0   España        3
1  Francia        5
2    Japón        2
3      USA        2

In [44]:
qry = '''
SELECT country, AVG(number_of_rooms) AS avg_rooms
FROM airbnb_listings
GROUP BY country
ORDER BY avg_rooms ASC
'''
# para visualizar la salida, usaremos pandas
df =pd.read_sql_query(qry, conn)

df.head()

   country  avg_rooms
0    Japón        2.0
1      USA        2.0
2   España        3.0
3  Francia        5.0

In [45]:
qry = '''
SELECT country, AVG(number_of_rooms) AS avg_rooms
FROM airbnb_listings
WHERE country IN ('USA','Japón')
GROUP BY country
ORDER BY avg_rooms ASC;
'''
# para visualizar la salida, usaremos pandas
df =pd.read_sql_query(qry, conn)

df.head()

  country  avg_rooms
0   Japón        2.0
1     USA        2.0

In [46]:
qry = '''
SELECT country, COUNT(city) AS number_cities
FROM airbnb_listings
GROUP BY country
ORDER BY number_cities ASC;
'''
# para visualizar la salida, usaremos pandas
df =pd.read_sql_query(qry, conn)

df.head()

   country  number_cities
0   España              1
1  Francia              1
2    Japón              1
3      USA              1

HAVING similar WHERE pero siempre con agregaciones

In [47]:
qry = '''
SELECT created_at
FROM airbnb_listings
GROUP BY created_at
HAVING COUNT(id) >= 2;
'''
# para visualizar la salida, usaremos pandas
df =pd.read_sql_query(qry, conn)

df.head()

   created_at
0        2022

JOINS

(INNER) JOIN: Devuelve los registros que tienen valores que coinciden en ambas tablas.
LEFT (OUTER) JOIN: Devuelve todos los registros de la tabla izquierda y los registros que coinciden con la tabla derecha.
RIGHT (OUTER) JOIN: Devuelve todos los registros de la tabla derecha y los registros que coinciden con la tabla izquierda.
FULL (OUTER) JOIN: Devuelve todos los registros cuando hay una coincidencia en la tabla izquierda o derecha.

In [49]:
# creamos otra tabla
conn.execute('''
CREATE TABLE airbnb_rooms(
	id INT AUTO_INCREMENT UNIQUE PRIMARY KEY,
  home_type VARCHAR(255) NOT NULL,
  room_type VARCHAR(255) NOT NULL,
	num_accomodates INT NOT NULL,
  city VARCHAR(255) NOT NULL
);''')

conn.commit()

In [50]:
# insertamos datos
conn.execute('''
INSERT INTO airbnb_rooms
  (id, home_type, room_type, num_accomodates, city)
  VALUES
  (1,  "Apartment",         "Entire",        2,  "Barcelona"),
  (2,  "Apartment",         "Shared",        3,  "París" ),
  (3,  "House",             "Shared",        5,  "Tokio" ),
  (4,  "Bed and breakfast", "Private room",  4,  "Nueva York"),
  (5,  "House",             "Shared",        5,  "Madrid" ),
  (6,  "Apartment",         "Private room",  7,  "Berlín" );''')
conn.commit()

In [ ]:
# conn.execute('''
# DROP TABLE airbnb_rooms;
# ''')
# conn.commit()

In [51]:
# visualizamos la nueva tabla
# creamos la query y la guardamos en la variable qry
qry = '''
SELECT *
FROM airbnb_rooms;
'''

# para visualizar la salida, usaremos pandas
df =pd.read_sql_query(qry, conn)

df.head(10)

   id          home_type     room_type  num_accomodates        city
0   1          Apartment        Entire                2   Barcelona
1   2          Apartment        Shared                3       París
2   3              House        Shared                5       Tokio
3   4  Bed and breakfast  Private room                4  Nueva York
4   5              House        Shared                5      Madrid
5   6          Apartment  Private room                7      Berlín

In [52]:
## INNER JOIN

In [53]:
# inner join
qry = '''
SELECT airbnb_listings.city , airbnb_rooms.home_type, airbnb_listings.number_of_rooms, airbnb_listings.country
FROM airbnb_listings
INNER JOIN airbnb_rooms
ON airbnb_listings.city=airbnb_rooms.city;
'''

# para visualizar la salida, usaremos pandas
df =pd.read_sql_query(qry, conn)

df.head(10)

         city          home_type  number_of_rooms  country
0       París          Apartment                5  Francia
1       Tokio              House                2    Japón
2  Nueva York  Bed and breakfast                2      USA
3      Madrid              House                3   España

In [54]:
## LEFT JOIN

In [55]:
# left join
qry = '''
SELECT airbnb_listings.city , airbnb_rooms.home_type, airbnb_listings.number_of_rooms, airbnb_listings.country
FROM airbnb_listings
LEFT JOIN airbnb_rooms
ON airbnb_listings.city = airbnb_rooms.city;
'''

# para visualizar la salida, usaremos pandas
df =pd.read_sql_query(qry, conn)

df.head(10)

         city          home_type  number_of_rooms  country
0       París          Apartment                5  Francia
1       Tokio              House                2    Japón
2  Nueva York  Bed and breakfast                2      USA
3      Madrid              House                3   España

In [56]:
## RIGHT JOIN

In [57]:
# right join
qry = '''
SELECT airbnb_rooms.city , airbnb_rooms.home_type, airbnb_listings.number_of_rooms, airbnb_listings.country
FROM airbnb_rooms
LEFT JOIN airbnb_listings
ON airbnb_listings.city=airbnb_rooms.city;
'''

# para visualizar la salida, usaremos pandas
df =pd.read_sql_query(qry, conn)

df.head(10)

         city          home_type  number_of_rooms  country
0   Barcelona          Apartment              NaN     None
1       París          Apartment              5.0  Francia
2       Tokio              House              2.0    Japón
3  Nueva York  Bed and breakfast              2.0      USA
4      Madrid              House              3.0   España
5      Berlín          Apartment              NaN     None

In [58]:
## full join

In [59]:
# full join
qry = '''
SELECT airbnb_listings.city , airbnb_rooms.home_type, airbnb_listings.number_of_rooms, airbnb_listings.country
FROM airbnb_listings
LEFT JOIN airbnb_rooms
ON airbnb_listings.city = airbnb_rooms.city
UNION ALL
SELECT airbnb_listings.city , airbnb_rooms.home_type, airbnb_listings.number_of_rooms, airbnb_listings.country
FROM airbnb_rooms
LEFT JOIN airbnb_listings
ON airbnb_listings.city=airbnb_rooms.city;
'''

# para visualizar la salida, usaremos pandas
df =pd.read_sql_query(qry, conn)

df.head(10)

         city          home_type  number_of_rooms  country
0       París          Apartment              5.0  Francia
1       Tokio              House              2.0    Japón
2  Nueva York  Bed and breakfast              2.0      USA
3      Madrid              House              3.0   España
4        None          Apartment              NaN     None
5       París          Apartment              5.0  Francia
6       Tokio              House              2.0    Japón
7  Nueva York  Bed and breakfast              2.0      USA
8      Madrid              House              3.0   España
9        None          Apartment              NaN     None

CONSULTAS ANIDADAS

Las consultas anidadas o subconsultas son dos o más consultas donde el resultado de una consulta se utiliza como parámetro para realizar la siguiente consulta.

In [60]:
# consultas anidadas
qry = '''
SELECT *
FROM airbnb_rooms
WHERE city IN (SELECT city FROM airbnb_listings);
'''

# para visualizar la salida, usaremos pandas
df =pd.read_sql_query(qry, conn)

df.head(10)

   id          home_type     room_type  num_accomodates        city
0   2          Apartment        Shared                3       París
1   3              House        Shared                5       Tokio
2   4  Bed and breakfast  Private room                4  Nueva York
3   5              House        Shared                5      Madrid

PROYECTO EXPLICADO AIRBNB POR NODD3R

Rosana Longares